# Python Pandas Tutorial (Part 6): Add/Remove Rows and Columns From DataFrames

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("/home/mostafiz/Python-Practice/Pandas/DataSet/developer_survey_2019/survey_results_public.csv")

df_schema = pd.read_csv("/home/mostafiz/Python-Practice/Pandas/DataSet/developer_survey_2019/survey_results_schema.csv")

In [40]:
people = {
    'first': ['Corey', 'Jane', 'John'], 
    'last': ['Schafer', 'Doe', 'Doe'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [41]:
df_new = pd.DataFrame(people)

# Adding two columns

In [42]:
df_new['FullName'] = df_new['first'] + ' ' + df_new['last']

In [43]:
df_new

   first     last                    email       FullName
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

# Removing column

In [44]:
#Use drop method, passing a list because we have multiple columns to delete
df_new.drop(columns=['first', 'last'], inplace=True)

In [45]:
df_new

                     email       FullName
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

# Split these fullnames

In [46]:
df_new['FullName'].str.split('  ') #Space is split method is mendatory

0    [Corey Schafer]
1         [Jane Doe]
2         [John Doe]
Name: FullName, dtype: object

In [47]:
#To expand the names - use expand attribute
df_new['FullName'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

# Split the above list into columns

In [48]:
#As we are apliting into two columns, we need to use list
df_new[['first', 'last']] = df_new['FullName'].str.split(' ', expand=True)

In [49]:
df_new

                     email       FullName  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

# Add/Remove columns and data

In [50]:
#Adding a single row with few values: the error becuase we did not give the index
df_new.append({'first': 'Tony'})

TypeError: Can only append a Series if ignore_index=True or if the Series has a name

In [51]:
df_new.append({'first': 'Tony'}, ignore_index=True)

                     email       FullName  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

# We can append two dataframes into one

In [52]:
people2 = {
    'first':['ahiyaan', 'abdullah'],
    'last': ['aswad', 'omar'],
    'email': ['aswadahiyann@email.com', 'omarabdullah@email.com'] 
}

In [53]:
df2 = pd.DataFrame(people2)

In [38]:
df2

      first   last                   email
0   ahiyaan  aswad  aswadahiyann@email.com
1  abdullah   omar  omarabdullah@email.com

In [54]:
df_new = df_new.append(df2, ignore_index=True, sort=False)

In [55]:
df_new

                     email       FullName     first     last
0  CoreyMSchafer@gmail.com  Corey Schafer     Corey  Schafer
1        JaneDoe@email.com       Jane Doe      Jane      Doe
2        JohnDoe@email.com       John Doe      John      Doe
3   aswadahiyann@email.com            NaN   ahiyaan    aswad
4   omarabdullah@email.com            NaN  abdullah     omar

# Dropping by index

In [67]:
df_new = df_new.drop(index = 4)

In [68]:
df_new

                     email       FullName    first     last
0  CoreyMSchafer@gmail.com  Corey Schafer    Corey  Schafer
1        JaneDoe@email.com       Jane Doe     Jane      Doe
2        JohnDoe@email.com       John Doe     John      Doe
3   aswadahiyann@email.com            NaN  ahiyaan    aswad

# Drop by filter

In [62]:
filt = df_new['first'] == 'ahiyaan'

In [71]:
df_new = df_new.drop(df_new[filt].index)

<ipython-input-71-1d5520a8cff2>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df_new = df_new.drop(df_new[filt].index)

In [72]:
df_new

                     email       FullName  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe